<h1><font color='green' size='100px'>Salary Prediction</font></h1>

# Importing the  required libraries for data preprocessing and plotting

In [303]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Importing the required functions from sklearn

In [304]:
from sklearn.preprocessing import StandardScaler
from sklearn import metrics
from sklearn.metrics import r2_score,mean_absolute_error as mae,mean_squared_error as mse

# Loading the datasets of train and test data

In [305]:
train=pd.read_csv('Data_file.xlsx - Data.csv',header=2)
test=pd.read_csv('Test_data_file.xlsx - Prediction.csv')

# Displaying the first 5 rows of train data using head() method

In [306]:
train.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,Tier 1,Manager,Non-Metro,"55,523.00",3,66,19,"71,406.58"
1,2,Tier 2,Executive,Metro,"57,081.00",1,84,18,"68,005.87"
2,3,Tier 2,Executive,Metro,"60,347.00",2,52,28,"76,764.02"
3,4,Tier 3,Executive,Metro,"49,010.00",2,81,33,"82,092.39"
4,5,Tier 3,Executive,Metro,"57,879.00",4,74,32,"73,878.10"

# Displaying the first 5 rows of test data using head() method

In [307]:
test.head()

,College,Role,City type,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC
0,Tier 1,Manager,Non-Metro,1,0,1,0,55523,3,66,19,71406.57653
1,Tier 2,Executive,Metro,0,1,0,1,57081,1,84,18,68005.87063
2,Tier 2,Executive,Metro,0,1,0,1,60347,2,52,28,76764.02028
3,Tier 3,Executive,Metro,0,0,0,1,49010,2,81,33,82092.38688
4,Tier 3,Executive,Metro,0,0,0,1,57879,4,74,32,73878.09773

# Types of info stored in our data

In [308]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   S.No.                 1338 non-null   int64
 1   College               1338 non-null   object
 2   Role                  1338 non-null   object
 3   City type             1338 non-null   object
 4   Previous CTC          1338 non-null   object
 5   Previous job changes  1338 non-null   int64
 6   Graduation marks      1338 non-null   int64
 7   Exp (Months)          1338 non-null   int64
 8   CTC                   1338 non-null   object
dtypes: int64(4), object(5)
memory usage: 94.2+ KB

# checking for null values

In [309]:
train.isnull().sum()

S.No.                   0
College                 0
Role                    0
City type               0
Previous CTC            0
Previous job changes    0
Graduation marks        0
Exp (Months)            0
CTC                     0
dtype: int64

# Checking for the duplicated rows

In [310]:
train.duplicated().sum()

0

# Getting the summary or statistical information of trained data using describe() function

In [311]:
train.describe()

             S.No.  Previous job changes  Graduation marks  Exp (Months)
count  1338.000000           1338.000000       1338.000000   1338.000000
mean    669.500000              2.525411         59.890882     39.207025
std     386.391641              1.123502         14.894696     14.049960
min       1.000000              1.000000         35.000000     18.000000
25%     335.250000              2.000000         47.000000     27.000000
50%     669.500000              3.000000         60.000000     39.000000
75%    1003.750000              4.000000         73.000000     51.000000
max    1338.000000              4.000000         85.000000     64.000000

# Creating dummies for categorical variables and converting categorical variables to numerical variables

In [312]:
train=pd.get_dummies(columns=['College','Role','City type'],data=train)

# Displaying the first 5 rows of trained data after creating dummies

In [313]:
train.head()

,S.No.,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,College_Tier 1,College_Tier 2,College_Tier 3,Role_Executive,Role_Manager,City type_Metro,City type_Non-Metro
0,1,"55,523.00",3,66,19,"71,406.58",1,0,0,0,1,0,1
1,2,"57,081.00",1,84,18,"68,005.87",0,1,0,1,0,1,0
2,3,"60,347.00",2,52,28,"76,764.02",0,1,0,1,0,1,0
3,4,"49,010.00",2,81,33,"82,092.39",0,0,1,1,0,1,0
4,5,"57,879.00",4,74,32,"73,878.10",0,0,1,1,0,1,0

# Displaying columns of our trained data set

In [314]:
train.columns

Index(['S.No.', 'Previous CTC', 'Previous job changes', 'Graduation marks',
       'Exp (Months)', 'CTC', 'College_Tier 1', 'College_Tier 2',
       'College_Tier 3', 'Role_Executive', 'Role_Manager', 'City type_Metro',
       'City type_Non-Metro'],
      dtype='object')

In [315]:
# The 'CTC' and 'Previous CTC' in our trained data set  has comma in it so we need to replace our the comma with empty string

In [316]:
train['CTC']=train['CTC'].str.replace(',','')
train['Previous CTC']=train['Previous CTC'].str.replace(',','')

In [317]:
# converting the 'CTC' and 'Previous CTC' from string data type to floating data type

In [318]:
train['CTC']=train['CTC'].astype('float')
train['Previous CTC']=train['Previous CTC'].astype('float')

# Notice the changes of CTC and Previous CTC in our trained data

In [319]:
train.head()

,S.No.,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,College_Tier 1,College_Tier 2,College_Tier 3,Role_Executive,Role_Manager,City type_Metro,City type_Non-Metro
0,1,55523.0,3,66,19,71406.58,1,0,0,0,1,0,1
1,2,57081.0,1,84,18,68005.87,0,1,0,1,0,1,0
2,3,60347.0,2,52,28,76764.02,0,1,0,1,0,1,0
3,4,49010.0,2,81,33,82092.39,0,0,1,1,0,1,0
4,5,57879.0,4,74,32,73878.10,0,0,1,1,0,1,0

In [320]:
test.head()

,College,Role,City type,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC
0,Tier 1,Manager,Non-Metro,1,0,1,0,55523,3,66,19,71406.57653
1,Tier 2,Executive,Metro,0,1,0,1,57081,1,84,18,68005.87063
2,Tier 2,Executive,Metro,0,1,0,1,60347,2,52,28,76764.02028
3,Tier 3,Executive,Metro,0,0,0,1,49010,2,81,33,82092.38688
4,Tier 3,Executive,Metro,0,0,0,1,57879,4,74,32,73878.09773

# Dropping the unwanted dummy variables in trained data

In [321]:
drop_list=['College_Tier 3','City type_Non-Metro','Role_Executive']
train.drop(drop_list,axis=1,inplace=True)

# Modifications reflected in our trained data columns

In [322]:
train.columns

Index(['S.No.', 'Previous CTC', 'Previous job changes', 'Graduation marks',
       'Exp (Months)', 'CTC', 'College_Tier 1', 'College_Tier 2',
       'Role_Manager', 'City type_Metro'],
      dtype='object')

In [323]:
# There are some unneccesary variables in our test data like 'College' ,'Role' and 'City type'

# We need to drop them

In [324]:
drop_list2=['College','Role','City type']
test.drop(drop_list2,axis=1,inplace=True)

# Modifications reflected in our test data columns

In [325]:
test.columns

Index(['College_T1', 'College_T2', 'Role_Manager', 'City_Metro',
       'previous CTC', 'previous job changes', 'Graduation marks', 'Exp',
       'Actual CTC'],
      dtype='object')

In [326]:
train.head()

,S.No.,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,College_Tier 1,College_Tier 2,Role_Manager,City type_Metro
0,1,55523.0,3,66,19,71406.58,1,0,1,0
1,2,57081.0,1,84,18,68005.87,0,1,0,1
2,3,60347.0,2,52,28,76764.02,0,1,0,1
3,4,49010.0,2,81,33,82092.39,0,0,0,1
4,5,57879.0,4,74,32,73878.10,0,0,0,1

In [327]:
test.head()

,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC
0,1,0,1,0,55523,3,66,19,71406.57653
1,0,1,0,1,57081,1,84,18,68005.87063
2,0,1,0,1,60347,2,52,28,76764.02028
3,0,0,0,1,49010,2,81,33,82092.38688
4,0,0,0,1,57879,4,74,32,73878.09773

# Setting index as S.No to our trained data

In [328]:
train.set_index('S.No.',inplace=True)

In [329]:
train.head()

,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,College_Tier 1,College_Tier 2,Role_Manager,City type_Metro
S.No.,,,,,,,,,
1,55523.0,3,66,19,71406.58,1,0,1,0
2,57081.0,1,84,18,68005.87,0,1,0,1
3,60347.0,2,52,28,76764.02,0,1,0,1
4,49010.0,2,81,33,82092.39,0,0,0,1
5,57879.0,4,74,32,73878.10,0,0,0,1

# Rearranging the columns for test and trained data

In [330]:
# rearranging the columns for trained data
train=train[['College_Tier 1','College_Tier 2','Role_Manager','City type_Metro','Previous CTC','Previous job changes','Graduation marks','Exp (Months)','CTC']]

In [331]:
# rearranging the test data
test=test[['College_T1','College_T2','Role_Manager','City_Metro','previous CTC','previous job changes','Graduation marks','Exp','Actual CTC']]

In [332]:
train.head(0)

Empty DataFrame
Columns: [College_Tier 1, College_Tier 2, Role_Manager, City type_Metro, Previous CTC, Previous job changes, Graduation marks, Exp (Months), CTC]
Index: []

In [333]:
test.head(0)

Empty DataFrame
Columns: [College_T1, College_T2, Role_Manager, City_Metro, previous CTC, previous job changes, Graduation marks, Exp, Actual CTC]
Index: []

In [334]:
# Renaming the variables of trained data to variable names of test data
train.columns=['College_T1','College_T2','Role_Manager','City_Metro','previous CTC','previous job changes','Graduation marks','Exp','Actual CTC']

In [335]:
train.head(0)

Empty DataFrame
Columns: [College_T1, College_T2, Role_Manager, City_Metro, previous CTC, previous job changes, Graduation marks, Exp, Actual CTC]
Index: []

In [336]:
test.head(0)

Empty DataFrame
Columns: [College_T1, College_T2, Role_Manager, City_Metro, previous CTC, previous job changes, Graduation marks, Exp, Actual CTC]
Index: []

# Splitting the data of trained data into dependent and independent data variables

In [337]:
# Considering the 'Actual CTC' as dependent variable and remaining variables as independent variables

x_train=train.drop('Actual CTC',axis=1)
y_train=train[['Actual CTC']]

# Splitting the data of test data into dependent and independent variables

In [338]:
# Considering the 'Actual CTC' as dependent variable and remaining variables as independent variables
x_test=test.drop('Actual CTC',axis=1)
y_test=test[['Actual CTC']]

# Standardisation of x_train and x_test data

In [339]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

In [340]:
x_train

array([[ 1.0303559 , -0.61132367,  1.97058663, ...,  0.42257741,
         0.4103073 , -1.43876426],
       [-0.97053843,  1.63579466, -0.5074631 , ..., -1.35823699,
         1.61924306, -1.50996545],
       [-0.97053843,  1.63579466, -0.5074631 , ..., -0.46782979,
        -0.52997607, -0.79795355],
       ...,
       [-0.97053843,  1.63579466, -0.5074631 , ..., -1.35823699,
        -0.86579156, -1.50996545],
       [ 1.0303559 , -0.61132367, -0.5074631 , ...,  0.42257741,
         0.61179659, -1.29636188],
       [-0.97053843, -0.61132367,  1.97058663, ..., -1.35823699,
        -0.86579156,  1.55168573]])

In [341]:
x_test

array([[ 1.0303559 , -0.61132367,  1.97058663, ...,  0.42257741,
         0.4103073 , -1.43876426],
       [-0.97053843,  1.63579466, -0.5074631 , ..., -1.35823699,
         1.61924306, -1.50996545],
       [-0.97053843,  1.63579466, -0.5074631 , ..., -0.46782979,
        -0.52997607, -0.79795355],
       ...,
       [-0.97053843,  1.63579466, -0.5074631 , ..., -1.35823699,
        -0.86579156, -1.50996545],
       [ 1.0303559 , -0.61132367, -0.5074631 , ...,  0.42257741,
         0.61179659, -1.29636188],
       [-0.97053843, -0.61132367,  1.97058663, ..., -1.35823699,
        -0.86579156,  1.55168573]])

# We are using Linear Regression model

In [342]:
from sklearn.linear_model import LinearRegression

In [343]:
# model creation
model=LinearRegression()

In [344]:
# fitting of x_train and y_train data to our model
model.fit(x_train,y_train)

LinearRegression()

# Predicting the x_test data using our model

In [345]:
y_pred=model.predict(x_test)
y_pred

array([[86123.93772412],
       [65789.54686289],
       [69941.69069909],
       ...,
       [64046.07494261],
       [66223.22214183],
       [90794.94080771]])

# We need to evaluate the performance of our model

In [346]:
# R2 Score
r2_score(y_test,y_pred)

0.6081873160460819

In [347]:
print("accuaracy of our model is ",r2_score(y_test,y_pred)*100,"%")

accuaracy of our model is  60.81873160460819 %

In [348]:
print("Mean average error is ",mae(y_test,y_pred))

Mean average error is  6159.175550813232

In [349]:
print("Mean squared error is ",mse(y_test,y_pred))

Mean squared error is  61677937.04476763

In [350]:
print("Root mean squared error is ",np.sqrt(mse(y_test,y_pred)))

Root mean squared error is  7853.530228169217